//
// Created by Алексей Шевченко on 31.03.2023.
//

#ifndef LAB_01_STATIONS_H
#define LAB_01_STATIONS_H

#include <algorithm>
#include <iostream>
#include <queue>
#include <vector>
#include <stack>
#include <map>

// Инициализация списка станций
const std::vector<std::string> stations = { "Охотный ряд",  "Театральная", "Площадь Революции", "Тверская",
                                            "Пушкинская", "Чекаловская", "Кузнецкий Мост", "Лубянка",
                                            "Чистые пруды", "Тургеневская",  "Сретненский бульвар",  "Трубная",
                                            "Цветной бульвар",  "Александровский сад","Арбатская (синяя)",  "Боровитская",
                                            "Библиотека имени Ленина",  "Арбатская (голубая)","Китай-город (оранжевая)",  "Китай-город (фиолетовая)",
                                            "Третьяковская (оранжевая)",  "Третьяковская (жёлтая)", // 2
                                            "Новокузнецкая",  "Полянка",  "Кропоткинская",  "Смоленская (синяя)",
                                            "Смоленская (голубая)",  "Маяковская",  "Сухаревская",  "Красные ворота",
                                            "Комсомольская (красная)",  "Комсомольская (коричневая)",  "Курская (синяя)",  "Чкаловская",
                                            "Курская (коричневая)",  "Марсистская",  "Таганская (фиолетовая)",  "Таганская (коричневая)",
                                            "Павелецка (зелёная)", "Павелецкая (коричневая)",  "Серпуховская",  "Добровитская",
                                            "Октябрьская (оранжевая)", "Октябрьская (коричневая)",  "Парк культуры (красная)",  "Парк культуры (коричневая)",
                                            "Киевская (синяя)",  "Киевская (голубая)", "Киевская (коричневая)",  "Баррикадная",  "Краснопресненская",
                                            "Белорусская (зелёная)", "Белорусская (коричневая)",  "Менделеевская",  "Новослободская",
                                            "Проспект мира (оранжевая)", "Проспект мира (коричневая)", "Планерная", "Сходненская",
                                            "Тушинская", "Спартак", "Щукинская", "Октябрьское Поле",
                                            "Полежаевская", "Беговая", "Улица 1905 года", "Пролетарская",
                                            "Волгоградский проспект", "Текстильщики", "Кузьминки", "Рязанский проспект",
                                            "Выхино", "Лермонтовский проспект", "Жулебино", "Котельники",
                                            "Рассказовка", "Новопеределкино", "Боровское шоссе", "Солнцево",
                                            "Говорово", "Озёрная", "Мичуринский проспект", "Раменки",
                                            "Ломоносовский проспект", "Минская", "Парк Победы (жёлтая)",
                                            "Парк Победы (синий)"};




// Инициализация графа, номера станций - индексы в списке станций
std::map<int, std::vector<std::pair<int, int> > > metro = {
        {0, {{1, 3}, {2, 3}, {7, 1}, {16, 1}}},
        {1, {{0, 3}, {2, 3}, {3, 1}, {22, 2}}},
        {2, {{0, 3}, {1, 3}, {14, 2}, {32, 2}}},
        {3, {{4, 3}, {5, 3}, {1, 1}, {27, 1}}},
        {4, {{3, 3}, {5, 3}, {6, 2}, {49, 2}}},
        {5, {{3, 3}, {5, 3}, {12, 1}, {15, 2}}},
        {6, {{7, 3}, {4, 2}, {19, 1}}},
        {7, {{6, 3}, {0, 1}, {8, 2}}},
        {8, {{9, 3}, {10, 3}, {29, 1}, {7, 1}}},
        {9, {{8, 3}, {10, 3}, {28, 1}, {18, 1}}},
        {10, {{9, 3}, {8, 3}, {33, 2}, {11, 2}}},
        {11, {{12, 3}, {10, 2}}},
        {12, {{11, 3}, {53, 2}, {5, 1}}},
        {13, {{14, 3}, {15, 3}, {16, 3}, {17, 1}}},
        {14, {{13, 3}, {15, 3}, {16, 3}, {25, 2}, {2, 2}}},
        {15, {{13, 3}, {14, 3}, {16, 3}, {5, 2}, {23, 2}}},
        {16, {{13, 3}, {15, 3}, {14, 3}, {0, 1}, {24, 1}}},
        {17, {{13, 1}, {26, 2}}},
        {18, {{19, 3}, {9, 1}, {20, 2}}},
        {19, {{18, 3}, {36, 3}, {6, 1}}},
        {20, {{22, 3}, {21, 3}, {18, 2}, {42, 2}}},
        {21, {{20, 3}, {22, 3}, {35, 2}}},
        {22, {{20, 3}, {21, 3}, {38, 2}, {1, 2}}},
        {23, {{15, 2}, {40, 2}}},
        {24, {{16, 1}, {44, 2}}},
        {25, {{46, 1}, {14, 2}}},
        {26, {{47, 2}, {17, 2}}},
        {27, {{3, 1}, {51, 1}}},
        {28, {{9, 1}, {55, 1}}},
        {29, {{8,  1}, {30, 1}}},
        {30, {{31, 3}, {29, 1}}},
        {31, {{30, 3}, {56, 2}, {34, 3}}},
        {32, {{2, 2}, {34, 3}, {33, 3}}},
        {33, {{34, 3}, {32, 3}, {10, 2}}},
        {34, {{32, 3}, {33, 3}, {31, 3}, {37, 2}}},
        {35, {{37, 3}, {36, 3}, {21, 2}}},
        {36, {{37, 3}, {35, 3}, {19, 3}, {66, 3}}},
        {37, {{36, 3}, {35, 3}, {34, 2}, {39, 1}}},
        {38, {{22, 2}, {39, 3}}},
        {39, {{38, 3}, {37, 1}, {41, 1}}},
        {40, {{41, 3}, {23, 2}}},
        {41, {{40, 3}, {39, 1}, {43, 1}}},
        {42, {{43, 3}, {20, 2}}},
        {43, {{42, 3}, {41, 1}, {45, 1}}},
        {44, {{45, 3}, {24, 2}}},
        {45, {{44, 3}, {43, 1}, {48, 2}}},
        {46, {{47, 3}, {48, 3}, {25, 1}}},
        {47, {{46, 3}, {48, 3}, {26, 2}, {86, 1}}},
        {48, {{46, 3}, {47, 3}, {45, 2}, {50, 3}}},
        {49, {{50, 3}, {4, 2}, {65, 3}}},
        {50, {{49, 3}, {48, 3}, {52, 2}}},
        {51, {{52, 3}, {27, 1}}},
        {52, {{51, 3}, {50, 2}, {54, 2}}},
        {53, {{54, 3}, {12, 2}}},
        {54, {{53, 3}, {52, 2}, {56, 2}}},
        {55, {{56, 3}, {28, 1}}},
        {56, {{55, 3}, {54, 2}, {31, 2}}},

        // Планерная - Улица 1905 года
        {57, {{58, 3}}},
        {58, {{59, 3}, {57, 3}}},
        {59, {{58, 3}, {60, 3}}},
        {60, {{59, 3}, {61, 3}}},
        {61, {{60, 3}, {62, 3}}},
        {62, {{61, 3}, {63, 3}}},
        {63, {{62, 3}, {64, 2}}},
        {64, {{63, 2}, {65, 2}}},
        {65, {{64, 2}, {49, 2}}},

        // Пролетарская - Котельники
        {66, {{36, 3}, {67, 3}}},
        {67, {{66, 3}, {68, 3}}},
        {68, {{67, 3}, {69, 3}}},
        {69, {{68, 3}, {70, 3}}},
        {70, {{69, 3}, {71, 3}}},
        {71, {{70, 3}, {72, 3}}},
        {72, {{71, 3}, {73, 3}}},
        {73, {{72, 3}, {74, 3}}},
        {74, {{73, 3}}},

        // Рассказовка -Парк Победы
        {75, {{76, 3}}},
        {76, {{75, 3}, {77, 3}}},
        {77, {{76, 3}, {78, 3}}},
        {78, {{77, 3}, {79, 3}}},
        {79, {{78, 3}, {80, 3}}},
        {80, {{79, 3}, {81, 3}}},
        {81, {{80, 3}, {82, 3}}},
        {82, {{81, 3}, {83, 3}}},
        {83, {{82, 3}, {84, 3}}},
        {84, {{83, 3}, {85, 3}}},
        {85, {{84, 3}, {86, 1}}},
        {86, {{85, 1}, {87, 1}, {47, 1}}},
};

void OneKBFS(const int& from, const int& to);

#endif //LAB_01_STATIONS_H
